Revit 2026 API

# TilePatternTilesPerSeedNode Property

---

Get the number of tiles located at each seed node.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int TilesPerSeedNode { get; }
```
```vb
Public ReadOnly Property TilesPerSeedNode As Integer
	Get
```
```cpp
public:
property int TilesPerSeedNode {
	int get ();
}
```
```fsharp
member TilesPerSeedNode : int with get
```

#### Property Value

Int32

Currently the number of tiles per seed node is always either 1 or 2.

#### Reference

TilePattern Class

Autodesk.Revit.DB Namespace